ivan-marusic/CarTracker/firmware/stm32f429_sim7600_rawtcp/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <string.h>
#include <stm32f4xx_hal_uart.h>
#include "sim7600.h"
#include "gnss.h"
#include "string.h"
#include "stdio.h"
/*#include "dbg_uart.h"*/
#include "debug.h"

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
UART_HandleTypeDef huart5;
UART_HandleTypeDef huart2;

/* USER CODE BEGIN PV */

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_UART5_Init(void);
static void MX_USART2_UART_Init(void);
/* USER CODE BEGIN PFP */

static void SIM7600_FlushRx(uint32_t ms)
{
    uint8_t c;
    uint32_t t0 = HAL_GetTick();
    while (HAL_GetTick() - t0 < ms) {
        if (HAL_UART_Receive(&huart2, &c, 1, 5) != HAL_OK) break;
    }
}

void SIM7600_Test_HTTP_Get(void)
{
	LOG_INFO("----- SIM7600 HTTP GET TEST START -----");

	// *** HARD RESET MODEM ***
	if (SIM7600_ResetAndWaitReady(12000) != 0) {
	    LOG_ERROR("Modem boot timeout after CFUN=1,1");
	    return;
	}

	SIM7600_FlushRx(100);

	/* Open network with your APN*/
	if(SIM7600_TCP_NetOpen("TMSTATIC") != 0) {
		LOG_ERROR("NETOPEN FAILED");
		return;
	}

	// 2) Zaobiđi DNS za probu (IP za httpbin.org primjer; može se mijenjati)
	if (SIM7600_TCP_Open(0, "34.199.6.103", 80) != 0) {
	    LOG_ERROR("CIPOPEN by IP FAILED");
	    return;
	}
	LOG_INFO("TCP OPEN OK (by IP)");


	/* Open TCP connection to httpbin.org:80 */
	if(SIM7600_TCP_Open(0, "httpbin.org", 80) != 0) {
		LOG_ERROR("CIPOPEN FAILED");
		return;
	}
	LOG_INFO("TCP OPEN OK");

	/* HTTP GET request */
	const char http_get[] =
	        "GET /get HTTP/1.1\r\n"
	        "Host: httpbin.org\r\n"
	        "\r\n";

	int length = strlen(http_get);
	LOG_INFO("Sending HTTP GET (%d bytes)", length);

	if (SIM7600_TCP_Send(0, (uint8_t*)http_get, length, 8000) != 0) {
		LOG_ERROR("SEND FAILED");
		return;
	}

	LOG_INFO("SEND OK - waiting for server response...");

	/* Wait for response */
	char line[256];
	uint32_t start = HAL_GetTick();
	while (HAL_GetTick() - start < 5000)
	{
		int l = SIM7600_ReadLine(line, sizeof(line), 500);
		if (l > 0) {
			LOG_INFO("RX: %s", line);
		}
	}

	LOG_INFO("HTTP GET test done - closing TCP");

	/*Close connection*/
	SIM7600_TCP_Close(0);
	SIM7600_TCP_NetClose();

	LOG_INFO("----- SIM7600 HTTP GET TEST END ----");
}
/*
static void send_once_to_fly(void)
{
    // 1) Pripremi JSON BEZ novog reda na kraju
    const char *json = "{\"latitude\":44.110000,\"longitude\":15.400000,\"timestamp\":\"2025-08-09T16:30:00Z\"}";

    // 2) Digni mrežu s tvojim APN-om (ako već nije dignuta)
    if (SIM7600_TCP_NetOpen("onomondo") != 0) {
        LOG_ERROR("NETOPEN FAILED");
        return;
    }

    // 3) Pošalji HTTP POST (varijanta s duljinom)
    int r = SIM7600_HTTP_Post_Update_lenMode(json);
    if (r == 0) {
        LOG_INFO("POST OK");
    } else {
        LOG_ERROR("POST FAIL (%d). Retrying with no-len...", r);
        // fallback – probaj bez duljine (CTRL+Z)
        r = SIM7600_HTTP_Post_Update_noLen(json);
        if (r == 0) LOG_INFO("POST OK (no-len)");
        else LOG_ERROR("POST FAIL even w/ no-len (%d)", r);
    }

    // 4) (opcionalno) NETCLOSE ako želiš štedjeti
    // SIM7600_TCP_NetClose();
}
*/
// druga verzija send_once_to_fly
/*static void send_once_to_fly(void)
{
    // 1) Digni mrežu (robustna varijanta gore)
    if (SIM7600_TCP_NetOpen("onomondo") != 0) {
        LOG_ERROR("NETOPEN FAILED");
        return;
    }

    // 2) JSON BEZ trailing newline-a
    const char *json = "{\"latitude\":44.110000,\"longitude\":15.400000,\"timestamp\":\"2025-08-09T16:30:00Z\"}";

    int r = SIM7600_HTTP_Post_Fly(json);
    if (r == 0) LOG_INFO("POST OK");
    else        LOG_ERROR("POST FAIL (%d)", r);

    // 3) (opcionalno) ostavi NET otvoren za iduće slanje
    // SIM7600_TCP_NetClose();
}*/

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
/*
static void Error_Handler_Blink(void)
{
    while (1)
    {
    	HAL_Delay(200);
    }
}
*/

int __io_putchar(int ch)
{
    HAL_UART_Transmit(&huart5, (uint8_t*)&ch, 1, HAL_MAX_DELAY);
    return ch;
}


/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_UART5_Init();
  MX_USART2_UART_Init(); 		//
  /* USER CODE BEGIN 2 */

  /*dbg_uart5_init();

  printf("UART5 debug online @115200\r\n");

  // Optional: small delay for modem power-up
  HAL_Delay(1000);

  // Bring up GNSS (start early so fix can be acquired sooner)
  SIM7600_EnableGNSS();

  // PDP + IP stack via modem
  if (SIM7600_TCP_NetOpen("TM") != 0) {
	  Error_Handler_Blink();
  }

  // Connect to your Oracle VM (replace with your public IP/DNS)
  const char *HOST = "130.162.219.128";
  const uint16_t PORT = 4000;
  const uint8_t LINK = 0;

  if (SIM7600_TCP_Open(LINK, HOST, PORT) != 0) {
	  SIM7600_TCP_NetClose();
	  Error_Handler_Blink();
  }*/


  SIM7600_UART_Send("AT\r");
  HAL_Delay(200);
  SIM7600_UART_Send("ATE0\r");
  HAL_Delay(200);
  SIM7600_UART_Send("AT+CGPS=1\r");
  HAL_Delay(1500);

  //SIM7600_Test_HTTP_Get();


  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */

  // Send JSON line to VM very 10s
  while (1)
  {
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */

	/*GNSS_Location loc;
	int r = SIM7600_ReadLocation_GNSS(&loc);
	if (r == 0) {
		char json[192];
		int n = snprintf(json, sizeof(json),
		    "{\"latitude\":%.6f,\"longitude\":%.6f,\"timestamp\":\"%s\"}\n",
		    loc.latitude, loc.longitude, loc.iso8601);
		if (n > 0){
			int sr = SIM7600_TCP_Send(LINK, (const uint8_t*)json, n, 8000);
			if (sr != 0)
			{
				// reconnect if needed
				SIM7600_TCP_Close(LINK);
				HAL_Delay(2000);
				SIM7600_TCP_Open(LINK, HOST, PORT);
			}
		}
	}
	HAL_Delay(10000);*/

  int r = send_gps_minimal_to_fly();

  // Ako nema fixa ili privremeni problem, pokušaj ponovno za 3 s
  if (r != 0) {
	  HAL_Delay(3000);
	  continue;
  }

  HAL_Delay(10000);

  /* USER CODE END 3 */
  }

}
/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Configure the main internal regulator output voltage
  */
  __HAL_RCC_PWR_CLK_ENABLE();
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE3);

  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSI;
  RCC_OscInitStruct.PLL.PLLM = 8;
  RCC_OscInitStruct.PLL.PLLN = 50;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV4;
  RCC_OscInitStruct.PLL.PLLQ = 7;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV8;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV4;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_0) != HAL_OK)
  {
    Error_Handler();
  }
}

/**
  * @brief UART5 Initialization Function
  * @param None
  * @retval None
  */
static void MX_UART5_Init(void)
{

  /* USER CODE BEGIN UART5_Init 0 */

  /* USER CODE END UART5_Init 0 */

  /* USER CODE BEGIN UART5_Init 1 */

  /* USER CODE END UART5_Init 1 */
  huart5.Instance = UART5;
  huart5.Init.BaudRate = 115200;
  huart5.Init.WordLength = UART_WORDLENGTH_8B;
  huart5.Init.StopBits = UART_STOPBITS_1;
  huart5.Init.Parity = UART_PARITY_NONE;
  huart5.Init.Mode = UART_MODE_TX_RX;
  huart5.Init.HwFlowCtl = UART_HWCONTROL_NONE;
  huart5.Init.OverSampling = UART_OVERSAMPLING_16;
  if (HAL_UART_Init(&huart5) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN UART5_Init 2 */

  /* USER CODE END UART5_Init 2 */

}

/**
  * @brief USART2 Initialization Function
  * @param None
  * @retval None
  */
static void MX_USART2_UART_Init(void)
{

  /* USER CODE BEGIN USART2_Init 0 */

  /* USER CODE END USART2_Init 0 */

  /* USER CODE BEGIN USART2_Init 1 */

  /* USER CODE END USART2_Init 1 */
  huart2.Instance = USART2;
  huart2.Init.BaudRate = 115200;
  huart2.Init.WordLength = UART_WORDLENGTH_8B;
  huart2.Init.StopBits = UART_STOPBITS_1;
  huart2.Init.Parity = UART_PARITY_NONE;
  huart2.Init.Mode = UART_MODE_TX_RX;
  huart2.Init.HwFlowCtl = UART_HWCONTROL_NONE;
  huart2.Init.OverSampling = UART_OVERSAMPLING_16;
  if (HAL_UART_Init(&huart2) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN USART2_Init 2 */

  /* USER CODE END USART2_Init 2 */

}

/**
  * @brief GPIO Initialization Function
  * @param None
  * @retval None
  */
static void MX_GPIO_Init(void)
{
/* USER CODE BEGIN MX_GPIO_Init_1 */
/* USER CODE END MX_GPIO_Init_1 */

  /* GPIO Ports Clock Enable */
  __HAL_RCC_GPIOC_CLK_ENABLE();
  __HAL_RCC_GPIOD_CLK_ENABLE();

/* USER CODE BEGIN MX_GPIO_Init_2 */
/* USER CODE END MX_GPIO_Init_2 */
}

/* USER CODE BEGIN 4 */

/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
